# ExportPatternInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternInfo Constructor
ExportPatternInfo Class See Also
---
Constructs a new default ExportPatternInfo.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportPatternInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportPatternInfo()
```

# See Also
ExportPatternInfo Class
ExportPatternInfo Overload
Autodesk.Revit.DB Namespace